# >>> a='abcd'
# >>> a[::-1]
# 'dcba'

# >>> a=2
# >>> b=5
# >>> a,b = b,a
# >>> a
# 5
# >>> b
# 2


# >>> x = 'foo'  Immutable  types
# >>> y = x
# >>> y += 'bar'
# >>> y
# 'foobar'
# >>> x
# 'foo'

# >>> x = 'foo'
# >>> y = x
# >>> x += 'bar'
# >>> y
# 'foo'
# >>> x
# 'foobar'

# >>> x = [1, 2, 3]   mutable  types
# >>> y = x
# >>> x[0]=5
# >>> x
# [5, 2, 3]
# >>> y
# [5, 2, 3]
# >>>
# >>> y[0]=7
# >>> x
# [7, 2, 3]
# >>> y
# [7, 2, 3]


# Словарь: ключ-значение в одну строку в значение-ключ
# In [82]: r={'s':2,'d':3,'f':4}
# In [83]: {k:v for v,k in r.iteritems()}
# Out[83]: {2: 's', 3: 'd', 4: 'f'}


# Срезы
# In [84]: a=[2,3,4,5]

# In [85]: a[:]
# Out[85]: [2, 3, 4, 5]

# In [86]: a[::]
# Out[86]: [2, 3, 4, 5]

# In [87]: a[::-1]
# Out[87]: [5, 4, 3, 2]
